## >>>>>>>>>>>>> main branch <<<<<<<<<<<<<<<<<<<

In [2]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__        #for pandas version

'1.2.3'

In [3]:
pd.show_versions()          #show all library versions

C:\Users\Ranjit Singh\AppData\Local\Programs\Python\Python310\lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : e8093ba372f9adfe79439d90fe74b0b5b6dea9d6
python           : 3.10.6.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.16299
machine          : AMD64
processor        : Intel64 Family 6 Model 142 Stepping 9, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_India.1252

pandas           : 1.4.3
numpy            : 1.23.1
pytz             : 2022.1
dateutil         : 2.8.2
setuptools       : 63.2.0
pip              : 22.2.1
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.4.0
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
markupsafe       : 2.1.1
matplotlib       : 3.5.2
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.9.0
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None

In [7]:
import IPython as ip
ip.version_info

(8, 4, 0, '')

### series creating

In [2]:
listt=['a',3,3.3,True,'radhey']
ser1=pd.Series(listt)

ser1

0         a
1         3
2       3.3
3      True
4    radhey
dtype: object

In [10]:
emptyser=pd.Series([])
emptyser               # create for empty series

<ipython-input-10-c01efd6af1c8>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  emptyser=pd.Series([])

Series([], dtype: float64)

In [3]:
ser4=pd.Series([1,2,3,4,4],index=['a','b','c','d','e'],dtype=float,name='column_1')     #series creation method
ser4

a    1.0
b    2.0
c    3.0
d    4.0
e    4.0
Name: column_1, dtype: float64

In [23]:
scalar_value=pd.Series(0.5)         # for creation any one elment in the series
scalar_value

0    0.5
dtype: float64

## create Series with scaler value

In [22]:
scalar_value=pd.Series(0.5,index=[1,2,4,4])              #for creation same filling value series
scalar_value

1    0.5
2    0.5
4    0.5
4    0.5
dtype: float64

scalar=pd.Series(o.5,index=[1,2,3,4])

In [10]:
d=list('asdf')              #revise it next trik depensds on the basis
d

['a', 's', 'd', 'f']

In [9]:
import random

In [32]:
# data=pd.DataFrame(np.random.rand(8,4),columns=list('RSTV'))



# random.randint
# random.randrange
# random.choice(d)
# np.random.rand(2,4)
# np.random.randn(2,4)
# np.random.random((2,3))
# np.random.randint(2,5)   ...single element return
# passwo="".join(random.sample(all,l))   # all for string and l for size captcha create

4

In [5]:
data

          R         S         T         V
0  0.816955  0.520385  0.365694  0.906517
1  0.331314  0.002404  0.495975  0.026677
2  0.746749  0.445355  0.191945  0.925743
3  0.653608  0.988599  0.383838  0.880024
4  0.952382  0.223211  0.607325  0.580785
5  0.754014  0.579668  0.871513  0.970870
6  0.427464  0.575591  0.024454  0.935536
7  0.604438  0.395427  0.228293  0.620999

# rename column different types

In [6]:
df={'col one':[2,4],'col two':[4,9]}

In [7]:
df2=pd.DataFrame(data=df)

In [8]:
df2

   col one  col two
0        2        4
1        4        9

In [23]:
df2.rename({"col one":'col_one','col two':"col_two"},axis="columns",inplace=True)  #first method

In [19]:
df2

   col_one  col_two
0        2        4
1        4        9

In [20]:
df2.columns=['col one','col two']        #second method

In [21]:
df2

   col one  col two
0        2        4
1        4        9

In [29]:
df2.columns.str.replace("_"," ")             #using string formating rename column

Index(['col one', 'col two'], dtype='object')

In [30]:
df3=df2.columns.str.replace("_"," ")

In [31]:
df3

Index(['col one', 'col two'], dtype='object')

In [32]:
df2

   col_one  col_two
0        2        4
1        4        9

In [33]:
df2.columns=df3        #done remove _ with the space

In [34]:
df2

   col one  col two
0        2        4
1        4        9

In [ ]:
df2=df2.columns.str.replace("_"," ")        #third type of rename

In [35]:
df2.rename({"col one":'col_one'},axis="columns")    #you can use this type a particular column

   col_one  col two
0        2        4
1        4        9

In [41]:
df2.rename({'col two':"col_two"},axis="columns")      #here axis is compulsory passed here

   col one  col_two
0        2        4
1        4        9

# prefix and suffix method

In [42]:
df2

   col one  col two
0        2        4
1        4        9

In [44]:
df2.add_prefix("_c_")             #add a string in start position by using add_prefix()

   _c_col one  _c_col two
0           2           4
1           4           9

In [49]:
df2.add_suffix("_endig")           #add string in the end of columns by using add_suffix()

   col one_endig  col two_endig
0              2              4
1              4              9

# reverse row printed

In [3]:
polic=pd.read_csv('pollice data.csv',parse_dates=['stop_date','stop_time'])     
#here i am change the dtype stop_date,& stop_time

In [38]:
polic.dtypes

stop_date             datetime64[ns]
stop_time             datetime64[ns]
country_name                 float64
driver_gender                 object
driver_age_raw               float64
driver_age                   float64
driver_race                   object
violation_raw                 object
violation                     object
search_conducted                bool
search_type                   object
stop_outcome                  object
is_arrested                   object
stop_duration                 object
drugs_related_stop              bool
dtype: object

In [6]:
polic[::-1]   #if u wannt to aces last row then u can step in minus

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
65534,12/7/2012,0:30,NaN,F,1985.0,27.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
65533,12/7/2012,0:23,NaN,NaN,NaN,NaN,NaN,NaN,NaN,False,NaN,NaN,NaN,NaN,False
65532,12/6/2012,23:20,NaN,M,1985.0,27.0,Black,Equipment/Inspection Violation,Equipment,False,NaN,Citation,False,0-15 Min,False
65531,12/6/2012,22:22,NaN,M,1954.0,58.0,White,Speeding,Speeding,False,NaN,Warning,False,0-15 Min,False
65530,12/6/2012,17:54,NaN,F,1987.0,25.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,3/14/2005,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
3,2/20/2005,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False
2,1/23/2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [29]:
polic.stop_date[0].day_name()             # for print the day_name()

'Sunday'

In [30]:
polic.describe()

       country_name  driver_age_raw    driver_age
count           0.0    61481.000000  61228.000000
mean            NaN     1967.791106     34.148984
std             NaN      121.050106     12.760710
min             NaN        0.000000     15.000000
25%             NaN     1965.000000     23.000000
50%             NaN     1978.000000     31.000000
75%             NaN     1985.000000     43.000000
max             NaN     8801.000000     88.000000

In [9]:
polic[::-1].head()           #for print the last position row  last 2 row

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
65534,2012-12-07,2021-07-06 00:30:00,NaN,F,1985.0,27.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
65533,2012-12-07,2021-07-06 00:23:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,False,NaN,NaN,NaN,NaN,False
65532,2012-12-06,2021-07-06 23:20:00,NaN,M,1985.0,27.0,Black,Equipment/Inspection Violation,Equipment,False,NaN,Citation,False,0-15 Min,False
65531,2012-12-06,2021-07-06 22:22:00,NaN,M,1954.0,58.0,White,Speeding,Speeding,False,NaN,Warning,False,0-15 Min,False
65530,2012-12-06,2021-07-06 17:54:00,NaN,F,1987.0,25.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [18]:
polic.index

RangeIndex(start=0, stop=65535, step=1)

In [15]:
polic[::-1].reset_index(drop=True).head()       #print last five row but index is true

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,2012-12-07,2021-07-06 00:30:00,NaN,F,1985.0,27.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,2012-12-07,2021-07-06 00:23:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,False,NaN,NaN,NaN,NaN,False
2,2012-12-06,2021-07-06 23:20:00,NaN,M,1985.0,27.0,Black,Equipment/Inspection Violation,Equipment,False,NaN,Citation,False,0-15 Min,False
3,2012-12-06,2021-07-06 22:22:00,NaN,M,1954.0,58.0,White,Speeding,Speeding,False,NaN,Warning,False,0-15 Min,False
4,2012-12-06,2021-07-06 17:54:00,NaN,F,1987.0,25.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

# reverse column printe
if you want to acces reverse column name then u always remeber that slicing is not support <br>
the column  name but u can use here column name by the loc function <br>
 and here step point given in minus value

In [68]:
df2.loc[:,::-1]          #for print the reverse column name

   col two  col one
0        4        2
1        9        4

# select column data by using data dtype

In [71]:
polic.head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [75]:
polic.dtypes

stop_date              object
stop_time              object
country_name          float64
driver_gender          object
driver_age_raw        float64
driver_age            float64
driver_race            object
violation_raw          object
violation              object
search_conducted         bool
search_type            object
stop_outcome           object
is_arrested            object
stop_duration          object
drugs_related_stop       bool
dtype: object

In [40]:
polic.select_dtypes(include='object').head(2)   
# polic.select_dtypes(include='O').head(2)   simply you can use capital 'O'
#whenever meet the condition than print datafrma acording to selecting include parameter

,driver_gender,driver_race,violation_raw,violation,search_type,stop_outcome,is_arrested,stop_duration
0,M,White,Speeding,Speeding,NaN,Citation,False,0-15 Min
1,M,White,Speeding,Speeding,NaN,Citation,False,0-15 Min

In [7]:
polic.dtypes[polic.dtypes=='object']

# or

polic.dtypes[polic.dtypes=='O']

# second method

driver_gender    object
driver_race      object
violation_raw    object
violation        object
search_type      object
stop_outcome     object
is_arrested      object
stop_duration    object
dtype: object

In [45]:
# pd.value_counts(polic.select_dtypes(include='object').dtypes ) 


polic.select_dtypes(include='O').dtypes.value_counts()


#according to this condition value_counts returning 10 , 
#it means, here 10 objects columns are present there

object    8
dtype: int64

In [48]:
pd.value_counts(polic.select_dtypes(include='object') )
#if you want to here pass  without dtypes then you remember that always
#here you fatch a dataframe after than u are checkouting the value_counts method
#it is not possible bcz value_counts apply on a series

ValueError: could not broadcast input array from shape (65535,8) into shape (65535,)

In [54]:
polic.select_dtypes(include='object')   #this is data frme so here value_counts method does not work

,stop_date,stop_time,driver_gender,driver_race,violation_raw,violation,search_type,stop_outcome,is_arrested,stop_duration
0,1/2/2005,1:55,M,White,Speeding,Speeding,NaN,Citation,False,0-15 Min
1,1/18/2005,8:15,M,White,Speeding,Speeding,NaN,Citation,False,0-15 Min
2,1/23/2005,23:15,M,White,Speeding,Speeding,NaN,Citation,False,0-15 Min
3,2/20/2005,17:15,M,White,Call for Service,Other,NaN,Arrest Driver,True,16-30 Min
4,3/14/2005,10:00,F,White,Speeding,Speeding,NaN,Citation,False,0-15 Min
...,...,...,...,...,...,...,...,...,...,...
65530,12/6/2012,17:54,F,White,Speeding,Speeding,NaN,Citation,False,0-15 Min
65531,12/6/2012,22:22,M,White,Speeding,Speeding,NaN,Warning,False,0-15 Min
65532,12/6/2012,23:20,M,Black,Equipment/Inspection Violation,Equipment,NaN,Citation,False,0-15 Min
65533,12/7/2012,0:23,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
65534,12/7/2012,0:30,F,White,Speeding,Speeding,NaN,Citation,False,0-15 Min

In [31]:
type(polic.select_dtypes(include="float64").dtypes)    # and now this series and u want to apply your 
#value counts method can apply
# polic.dtypes

pandas.core.series.Series

In [32]:
type(polic.select_dtypes(include="float64"))  #here this is dataframe
# and here u can,t apply value_counts method bcz ths is pandas dataframe

pandas.core.frame.DataFrame

In [53]:
print(type(polic.dtypes))
polic.dtypes

<class 'pandas.core.series.Series'>

stop_date             datetime64[ns]
stop_time             datetime64[ns]
country_name                 float64
driver_gender                 object
driver_age_raw               float64
driver_age                   float64
driver_race                   object
violation_raw                 object
violation                     object
search_conducted                bool
search_type                   object
stop_outcome                  object
is_arrested                   object
stop_duration                 object
drugs_related_stop              bool
dtype: object

In [47]:
polic.dtypes.shape

(15,)

In [56]:
polic.dtypes.value_counts()

object            8
float64           3
datetime64[ns]    2
bool              2
dtype: int64

In [57]:
pd.value_counts(polic.dtypes)      #chek for how many column float &
# and how many column integer by usiing value_counts

object            8
float64           3
datetime64[ns]    2
bool              2
dtype: int64

In [8]:
len(polic.dtypes)

15

In [9]:
polic.dtypes.value_counts()

object            8
float64           3
datetime64[ns]    2
bool              2
dtype: int64

In [103]:
pd.value_counts(polic.select_dtypes(exclude="float64").dtypes)
#exclude keyword means except the particular dtypes all dtype all fatch

object    10
bool       2
dtype: int64

In [104]:
pd.value_counts(polic.select_dtypes(exclude=["float64"]).dtypes)
#here u should keep remember that here u can apply multiple dtypes okay

object    10
bool       2
dtype: int64

In [100]:
pd.value_counts(polic.dtypes)

object     10
float64     3
bool        2
dtype: int64

In [72]:
polic.select_dtypes(include=["object","float64"]).head(2)
#here u can pass multiple data type but keep remeber 
#multiple dtypes must be present in a list

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_type,stop_outcome,is_arrested,stop_duration
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,NaN,Citation,False,0-15 Min
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,NaN,Citation,False,0-15 Min

In [62]:
polic.head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [66]:
polic[["stop_date","stop_time","driver_gender"]].head(2)

   stop_date stop_time driver_gender
0   1/2/2005      1:55             M
1  1/18/2005      8:15             M

In [58]:
polic["driver_gender"]=="M"

0         True
1         True
2         True
3         True
4        False
         ...
65530    False
65531     True
65532     True
65533    False
65534    False
Name: driver_gender, Length: 65535, dtype: bool

In [73]:
pd.value_counts(polic["driver_gender"]=="M")

True     45164
False    20371
Name: driver_gender, dtype: int64

In [10]:
dt=polic["driver_gender"]=="M"

In [11]:
pd.value_counts(dt)

True     45164
False    20371
Name: driver_gender, dtype: int64

In [13]:
polic[dt].head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,2005-01-02,2022-08-04 01:55:00,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,2005-01-18,2022-08-04 08:15:00,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

## reverse column trick

In [80]:
polic.head(3)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,1/23/2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [14]:
polic.loc[:,::-1].head(2)   
#for print the reverse column name

,drugs_related_stop,stop_duration,is_arrested,stop_outcome,search_type,search_conducted,violation,violation_raw,driver_race,driver_age,driver_age_raw,driver_gender,country_name,stop_time,stop_date
0,False,0-15 Min,False,Citation,NaN,False,Speeding,Speeding,White,20.0,1985.0,M,NaN,2022-08-04 01:55:00,2005-01-02
1,False,0-15 Min,False,Citation,NaN,False,Speeding,Speeding,White,40.0,1965.0,M,NaN,2022-08-04 08:15:00,2005-01-18

In [16]:
polic.loc[0:1,::-1]

,drugs_related_stop,stop_duration,is_arrested,stop_outcome,search_type,search_conducted,violation,violation_raw,driver_race,driver_age,driver_age_raw,driver_gender,country_name,stop_time,stop_date
0,False,0-15 Min,False,Citation,NaN,False,Speeding,Speeding,White,20.0,1985.0,M,NaN,2022-08-04 01:55:00,2005-01-02
1,False,0-15 Min,False,Citation,NaN,False,Speeding,Speeding,White,40.0,1965.0,M,NaN,2022-08-04 08:15:00,2005-01-18

In [68]:
sum(polic["driver_gender"]=="M")            #here boolean broadcastingsum()            #here boolean broadcastingsum()            #here boolean broadcastingsum()            #here boolean broadcasting

45164

## convert string to number

In [61]:
df=pd.DataFrame({"col_1":["1.1",'2.2','3.3'],
                "col_2":['4.4','5.5','6.6'],
                "col_3":['7.7','8.8','-']})

In [62]:
df

  col_1 col_2 col_3
0   1.1   4.4   7.7
1   2.2   5.5   8.8
2   3.3   6.6     -

In [107]:
df.dtypes

col_1    object
col_2    object
col_3    object
dtype: object

In [67]:
df['col_1'].astype('float64').dtypes

dtype('float64')

In [69]:
df["col_one"]= df['col_1'].astype("float")   #1st method but here another column is creating 
df.dtypes

col_1       object
col_2       object
col_3       object
col_one    float64
dtype: object

In [74]:
df2=df[['col_2','col_3','col_one']]
df2

  col_2 col_3  col_one
0   4.4   7.7      1.1
1   5.5   8.8      2.2
2   6.6     -      3.3

In [71]:
df.rename({'col_one':'col_1'},inplace=True)

  col_1 col_2 col_3  col_one
0   1.1   4.4   7.7      1.1
1   2.2   5.5   8.8      2.2
2   3.3   6.6     -      3.3

In [150]:
df3=pd.to_numeric(df2['col_2']).dtypes
#to_numeric used for as it is dtypes define

In [154]:
df2.dtypes

col_2       object
col_3       object
col_one    float64
dtype: object

In [77]:
df2['col_2'].dtypes

dtype('O')

In [78]:
df2.astype({'col_2':float})

   col_2 col_3  col_one
0    4.4   7.7      1.1
1    5.5   8.8      2.2
2    6.6     -      3.3

In [142]:
df.astype({'col_one':'str'}).dtypes   # 2nd method

col_1      object
col_2      object
col_3      object
col_one    object
dtype: object

In [117]:
df.astype({'col_one':'str','col_2':"float"})
#here u can multiple columns name

  col_1  col_2 col_3 col_one
0   1.1    4.4   7.7     1.1
1   2.2    5.5   8.8     2.2
2   3.3    6.6     -     3.3

In [118]:
df.dtypes

col_1       object
col_2       object
col_3       object
col_one    float64
dtype: object

## here we want to change the dtypes of column 3 but i have some issue chek it